'''3.1 数字的四舍五入
问题:
你想对浮点数执行指定精度的舍入运算。

解决方案:
对于简单的舍入运算，使用内置的 round(value, ndigits) 函数即可'''

round(1.23, 1)  # 1.2
round(1.27, 1)  # 1.3
round(-1.27, 1)  # -1.3
round(1.25361, 3)  # 1.254

# 当一个值刚好在两个边界的中间的时候， round 函数返回离它最近的偶数。
# 也就是说，对1.5或者2.5的舍入运算都会得到2
round(1.5)  # 2
round(3.5)  # 4

# 传给 round() 函数的 ndigits 参数可以是负数，这种情况下， 舍入运算会作用在十位、百位、千位等上面
a = 1627731
round(a, -1)  # 1627730
round(a, -2)  # 1627700
round(a, -3)  # 1627000

x = 1.23456
print(format(x, '0.2f'))  # 1.23
print(format(x, '0.3f'))  # 1.235
print('value is {:0.3f}'.format(x))  # value is 1.235
